######################基礎概要######################

######################註解方式######################

#單行可使用#
#多行:
#方法1:先選取欲註解的行,在按ctrl+/
#方法2:可使用3個雙引號或3個雙引號
#方法2範例:
'''此為註解,亂打也不會怎麼樣'''
"""此為註解,亂打真的不會怎麼樣"""

######################變數宣告######################

#不用先定義變數的資料類別,系統會自動判別輸入資料的類別再儲存至變數

a = 1 #整數int
b = 0.87 #浮點數float
c = "Test111" #字串string
d = 'Test222' #字串string
e = True #布林值:真 boolean:true
f = False #布林值:假 boolean:false
g = [3,5] #串列list
h = range(1,10) #範圍range()
i = (3,5,7,9) #元組tuple
j = {1,2,3} #集合set
k = {a:2, b:30, c:"I love you"} #字典dict

######################打印函數print######################

#把變數值打印出來
a = "薯條真好吃"
print(a)

######################資料類別函數type######################

#type(變數) ---> 變數類別
#範例:把變數類別打印出來
c = 666
print(type(c))

######################資料輸入函數input######################

#input("你的問題或提示")
#注意:input輸入的資料預設資料類別為字串(string)
#範例:讓使用者輸入資料並儲存在指定的變數裡面
a = input("你喜歡吃麥當勞嗎?")
print(a)

######################把變數資料類別轉換成整數的函數int######################

#範例:把字串類別string的資料轉換成整數類別int
a="2"
print(type(a))
a = int(a)
print(type(a))

######################把變數資料類別轉換成字串的函數str######################
a=2
print(type(a))
a = str(a)
print(type(a))

######################縮排######################
#tab或4格空白鍵

