######################運算符號使用方式######################

#加法使用符號 ---> +
#範例:
a = 1
print(a+1)

#減法使用符號 ---> -
#範例:
b = 1
print(b-1)

#乘法使用符號 ---> *
#範例:
c = 1
print(c*10)

#除法使用符號 ---> /
#範例:
d = 5
print(d/2)

#餘數使用符號 ---> %
#範例:
e = 10
print(e%3)

#指數使用符號 ---> **
f = 2
print(2**10)

######################精簡運算式寫法######################

#a+=1 ---> a=a+1
#範例:
a=4
a+=2
print(a)

#a-=1 ---> a=a-1
#範例:
b=5
b-=3
print(b)

#a*=2 ---> a=a*2
#範例:
b=5
b*=3
print(b)

#a/=2 ---> a=a/2
#範例:
d=10
d/=2
print(d)

#a%=3 ---> a=a%3
#範例:
e=8
e%=3
print(e)

#a**=10 ---> a=a**10
#範例:
f=2
f**=10
print(f)
