######################for迴圈使用方式######################

'''
for 某個集合裡的每個元素 in 某個集合:
    怎樣怎樣

備註:
1.某個集合裡的每個元素可以任意取名,你想叫他什麼就叫他什麼
2.某個集合可以是:
- string 字串
- range() 範圍
- list 串列
- tuple 元組
- dict 字典
- set 集合
'''

#範例1:打印出list a 裡面的每個值
a = [1,10,100]
for x in a:
    print(x)

#範例2:對於list b 裡面的每個值,打印出"聖光會懲罰你"
b=[7,8,9]
for mm in b:
    print("聖光會懲罰你")

#範例3:打印出字串中的每個字元
c = "也許未來遙遠在光年之外"
for s in c:
    print(s)

#範例4:打印出範圍1到4中的每個整數
d = range(1,5)
for n in d:
    print(n)

#範例5:打印出從0開始的5個整數
e = range(5)
for y in e:
    print(y)

