######################while迴圈使用方式######################

#說明:while迴圈適用於不清楚迴圈次數要執行幾次的情形,但也要小心使用避免成為無窮迴圈使程式錯誤

'''
while 判斷式:
    怎樣怎樣
'''
#範例:如果i小於10,打印出i的值然後回傳一個新的值給i
i = 0
while i<10:
    print(i)
    i+=1

'''
while 判斷式:
    怎樣怎樣
else:
    就怎樣怎樣
'''
#範例:如果i小於5,打印出""我不要",否則的話印出"好啊""
a = 1
while a<5:
    print("我不要")
    a+=1
else:
    print("好啊")

'''
while True:
    怎樣怎樣
    if 判斷式:
        break
'''
#範例:打印出b的值並回傳新的值給b值到迴圈終止
b = 0
while True:
    print("b的值現在是: "+str(b))
    b+=1
    if b>8:
        break
